Revit 2027 API
ParameterTypeId.FbxLightPhotometricsFam Property
 "Light Source Definition (family)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FbxLightPhotometricsFam { get; }
Public Shared ReadOnly Property FbxLightPhotometricsFam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FbxLightPhotometricsFam {
	ForgeTypeId^ get ();
}
static member FbxLightPhotometricsFam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace